{
    "appLaunchURL": "string: A URL the system passes to the associated app from associatedStoreIdentifiers during launch.",
    "associatedStoreIdentifiers": "[number]: An array of App Store identifiers for apps associated with the pass.",
    "authenticationToken": "string: The authentication token to use with the web service in the webServiceURL key.",
    "backgroundColor": "string: A background color for the pass, specified as a CSS-style RGB triple, such as rgb(23, 187, 82).",
    "barcode": "Pass.Barcode: An object that represents a barcode on a pass. This object is deprecated; use barcodes instead.",
    "barcodes": "[Pass.Barcodes]: An array of objects that represent possible barcodes on a pass.",
    "beacons": "[Pass.Beacons]: An array of objects that represents the identity of Bluetooth Low Energy beacons.",
    "boardingPass": "Pass.BoardingPass: An object that contains the information for a boarding pass.",
    "coupon": "Pass.Coupon: An object that contains the information for a coupon.",
    "description": "localizable string: (Required) A short description that iOS accessibility technologies use for a pass.",
    "eventTicket": "Pass.EventTicket: An object that contains the information for an event ticket.",
    "expirationDate": "string: The date and time the pass expires, in a complete date format with optional seconds.",
    "foregroundColor": "string: A foreground color for the pass, specified as a CSS-style RGB triple.",
    "formatVersion": "number: (Required) The version of the file format. The value must be 1.",
    "generic": "Pass.Generic: An object that contains the information for a generic pass.",
    "groupingIdentifier": "string: An identifier the system uses to group related boarding passes or event tickets.",
    "labelColor": "string: A color for the label text of the pass, specified as a CSS-style RGB triple.",
    "locations": "[Pass.Locations]: An array of up to 10 objects that represent geographic locations.",
    "logoText": "localizable string: The text to display next to the logo on the pass.",
    "maxDistance": "number: The maximum distance, in meters, from a location at which the pass is relevant.",
    "nfc": "Pass.NFC: An object that contains the information to use for Value Added Service Protocol transactions.",
    "organizationName": "localizable string: (Required) The name of the organization.",
    "passTypeIdentifier": "string: (Required) The pass type identifier registered with Apple.",
    "relevantDate": "string: The date and time when the pass becomes relevant as a W3C timestamp.",
    "semantics": "SemanticTags: An object with machine-readable metadata for the pass.",
    "serialNumber": "string: (Required) A unique alphanumeric serial number for each pass.",
    "sharingProhibited": "boolean: A Boolean value controlling whether to show the Share button on the back of a pass.",
    "storeCard": "Pass.StoreCard: An object that contains the information for a store card.",
    "suppressStripShine": "boolean: A Boolean value that controls whether to display the strip image without a shine effect.",
    "teamIdentifier": "string: (Required) The Team ID for the Apple Developer Program account.",
    "userInfo": "any JSON data: A dictionary containing custom information for companion apps.",
    "voided": "boolean: A Boolean value indicating whether the pass is void.",
    "webServiceURL": "string: The URL for a web service used to update or personalize the pass."
  }
  